In [21]:
import pandas as pd
dota = pd.read_csv('dota_hero_stats.csv')

In [22]:
dota.head()

,Unnamed: 0,attack_type,id,legs,localized_name,name,primary_attr,roles
0,0,Melee,1,2,Anti-Mage,npc_dota_hero_antimage,agi,"['Carry', 'Escape', 'Nuker']"
1,1,Melee,2,2,Axe,npc_dota_hero_axe,str,"['Initiator', 'Durable', 'Disabler', 'Jungler']"
2,2,Ranged,3,4,Bane,npc_dota_hero_bane,int,"['Support', 'Disabler', 'Nuker', 'Durable']"
3,3,Melee,4,2,Bloodseeker,npc_dota_hero_bloodseeker,agi,"['Carry', 'Disabler', 'Jungler', 'Nuker', 'Ini..."
4,4,Ranged,5,2,Crystal Maiden,npc_dota_hero_crystal_maiden,int,"['Support', 'Disabler', 'Nuker', 'Jungler']"

In [23]:
dota.groupby(['attack_type', 'primary_attr']).aggregate('count')

                          Unnamed: 0  id  legs  localized_name  name  roles
attack_type primary_attr
Melee       agi                   19  19    19              19    19     19
            int                    2   2     2               2     2      2
            str                   35  35    35              35    35     35
Ranged      agi                   18  18    18              18    18     18
            int                   40  40    40              40    40     40
            str                    3   3     3               3     3      3

In [8]:
import pandas as pd
lupu = pd.read_csv('accountancy.csv')
lupu.head()

   Unnamed: 0 Executor Type  Salary
0           0     Pupa    D      63
1           1     Pupa    A     158
2           2     Pupa    D     194
3           3     Pupa    E     109
4           4    Loopa    E     184

In [20]:
lupu.groupby(['Type', 'Executor']).aggregate({'Salary': 'mean'})

                   Salary
Type Executor
A    Loopa      58.000000
     Pupa      160.833333
B    Loopa     145.166667
     Pupa       77.000000
C    Loopa     154.333333
     Pupa       74.500000
D    Loopa     137.714286
     Pupa      146.500000
E    Loopa     164.000000
     Pupa      131.200000
F    Loopa     238.000000
     Pupa      136.250000

In [17]:
import pandas as pd
concentrations = pd.read_csv('algae1.csv')

In [18]:
concentrations

,species,genus,group,sucrose,alanin,citrate,glucose,oleic_acid
0,Fucus_vesiculosus,Fucus,brown,3.001472,3.711498,5.004262,2.548459,6.405165
1,Saccharina_japonica,Saccharina,brown,6.731070,1.255251,5.621499,6.013219,4.156700
2,Fucus_serratus,Fucus,brown,3.276870,0.346431,1.216767,3.623225,0.304573
3,Fucus_distichus,Fucus,brown,6.786996,6.641303,6.423606,2.272724,3.393203
4,Cladophora_fracta,Cladophora,green,3.861470,1.648450,6.940588,2.316955,2.528886
5,Cladophora_compacta,Cladophora,green,5.712284,3.461692,3.082826,3.343707,1.432514
6,Cladophora_gracilis,Cladophora,green,2.452623,6.881024,5.841520,2.740165,2.829016
7,Palmaria_palmata,Palmaria,red,0.704580,3.176440,5.573905,3.242090,2.245538
8,Saccharina_latissima,Saccharina,brown,1.636122,5.793163,1.071920,3.947968,4.817804
9,Ascophyllum_nodosum,Ascophyllum,brown,6.825467,0.875429,5.253527,3.414961,2.432526

In [23]:
mean_concentrations = concentrations.groupby('group').aggregate('max')

In [24]:
mean_concentrations

,species,genus,sucrose,alanin,citrate,glucose,oleic_acid
group,,,,,,,
brown,Saccharina_latissima,Saccharina,6.825467,6.641303,6.423606,6.013219,6.405165
green,Cladophora_gracilis,Cladophora,5.712284,6.881024,6.940588,3.343707,2.829016
red,Palmaria_palmata,Palmaria,0.704580,3.176440,5.573905,3.242090,2.245538

In [37]:
mean_concentrations = concentrations.groupby('group').agg('max')

In [38]:
mean_concentrations

,species,genus,sucrose,alanin,citrate,glucose,oleic_acid
group,,,,,,,
brown,Saccharina_latissima,Saccharina,6.825467,6.641303,6.423606,6.013219,6.405165
green,Cladophora_gracilis,Cladophora,5.712284,6.881024,6.940588,3.343707,2.829016
red,Palmaria_palmata,Palmaria,0.704580,3.176440,5.573905,3.242090,2.245538

In [42]:
import seaborn as sns
sns.__version__

'0.9.0'